# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..Value Property
DimensionSegment Class See Also
---
The length of the segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Nullable<double> Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As Nullable(Of Double)
	Get
```

Visual C++
---
```text
public:
property Nullable<double> Value {
	Nullable<double> get ();
}
```

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace